
# 1. 创建一张学生表（student），要求有id,姓名，出生年份，出生的年月日，进班的时间，以及来老男孩学习的现在具体时间。

#创建表
create table student(
    id int,
    name varchar(20),
    born_year year,
    birth date,
    class_time time,
    reg_time datetime
);

#插入3条记录
insert into student values
    (1,'alex',"1995","1995-11-11","11:11:11","2017-11-11 11:11:11"),
    (2,'egon',"1997","1997-12-12","12:12:12","2017-12-12 12:12:12"),
    (3,'wsb',"1998","1998-01-01","13:13:13","2017-01-01 13:13:13");

#查看表记录
mysql> select * from student;
+------+------+-----------+------------+------------+---------------------+
| id   | name | born_year | birth      | class_time | reg_time            |
+------+------+-----------+------------+------------+---------------------+
|    1 | alex |      1995 | 1995-11-11 | 11:11:11   | 2017-11-11 11:11:11 |
|    2 | egon |      1997 | 1997-12-12 | 12:12:12   | 2017-12-12 12:12:12 |
|    3 | wsb  |      1998 | 1998-01-01 | 13:13:13   | 2017-01-01 13:13:13 |
+------+------+-----------+------------+------------+---------------------+
3 rows in set (0.00 sec)











